{
  "backend/main.mo": "Motoko backend providing user profile management with access control and CRUD operations for storing and listing customer inquiries.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten one-line summaries for key frontend components, pages, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS layer defining industrial-themed OKLCH color variables and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point setting SEO metadata, loading Inter font, and mounting the frontend app.",
  "frontend/src/App.tsx": "Sets up TanStack Router and defines routes for all main pages wrapped in the Layout component.",
  "frontend/src/components/InquiryForm.tsx": "Form component with validation and success/error handling that formats and submits inquiries to the backend.",
  "frontend/src/components/Layout.tsx": "Layout wrapper containing SiteHeader, routed content via Outlet, and SiteFooter.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying company info, navigation links, and contact details with social icons.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header component with logo, desktop navigation, and toggleable mobile menu using router state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useSubmitInquiry.ts": "React Query mutation hook that submits an inquiry through the backend actor and invalidates related queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Application entry point that initializes React, React Query, and the Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the company's background and core values with styled content sections.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing address, phone, email, hours, and an inquiry form within a two-column layout.",
  "frontend/src/pages/HomePage.tsx": "Landing page with a hero section, call‑to‑action links, and highlight cards showcasing product quality, range, and delivery.",
  "frontend/src/pages/ManufacturingPage.tsx": "Displays manufacturing facility details, capacity stats, and process overview using icon-based info cards.",
  "frontend/src/pages/ProductsPage.tsx": "Renders a product catalog grid with descriptions and specifications for various fastener types.",
  "frontend/src/pages/QualityPage.tsx": "Presents the company's quality philosophy and lists key certifications with icon-based cards.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including hash-based query handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Defines project configuration for building the Guru Kirpa Mill Industries website, listing features, image requirements, and pending requests. Contains project metadata, existing features, and backend needs for inquiry storage."
}